sdaiFindInstanceUsers(Sdai_instS*,Sdai_Id_aggr*,Sdai_Id_aggr*)
\details
Retrieves the identifiers of all the entity instances in the model
that reference the current entity instance.
\param instance [in] Identifier of the entity instance whose users are requested.
\param domain [in] Identifier of a NPL containing the SdaiSchemaInstance identifiers of the
schema instances that define the domain of the function request.
\param resultList [in/out]  Identifier of the pre-existing NPL to which the
identifiers of the entity instances referencing the current instance by any attribute are added.
\returns Identifier of the result NPL.